controllers/SiteController.php

INSERT INTO "tbllog" ("id", "login") VALUES ('198306292010011024-1729472142', '2024-10-21 07:55:42') RETURNING "id"
---
    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            if(Yii::$app->user->identity->flag == 0) return $this->redirect(['/site/update-password']);
            return $this->goHome();
        }

        $this->layout = '//main-login';
        $model = new LoginForm();

        if ($model->load(Yii::$app->request->post()) && $model->login()) {

            $session = Yii::$app->session;
            $session['password'] = $model['password'];
            $session['username'] = $model['username'];
            $session['nip'] = Yii::$app->user->identity->nipBaru;
            $session['pengguna'] = Yii::$app->user->identity->pengguna;
            $session['namapengguna'] = Yii::$app->user->identity->namapengguna;
            $session['iduser'] = Yii::$app->user->identity->id;
            $session['roleadmin'] = \app\models\RoleUser::getRoleAdmin($session['iduser']);
            $session['tablokb'] =  Yii::$app->user->identity->tablok;

            $log_model = new \app\models\Tbllog();
            $log_model['id'] = $session['nip'].'-'.time();
            $log_model['login'] = date('Y-m-d H:i:s');
            $log_model->save();

SELECT * FROM "tbllog" WHERE "id"='198306292010011024-1729472142'
UPDATE "tbllog" SET "logout"='2024-10-21 07:55:51' WHERE "id"='198306292010011024-1729472142'
---
    public function actionSignOut()
    {
        $this->layout = '//main-indeks';
        $session = Yii::$app->session;
        $log_model = \app\models\Tbllog::findOne($session['log']);
        $log_model['logout'] = date('Y-m-d H:i:s');
        $log_model->save();